; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	spectrograph2 - mode
	thermograph4 - mode
	infrared3 - mode
	spectrograph1 - mode
	spectrograph0 - mode
	infrared5 - mode
	spectrograph6 - mode
	Star0 - direction
	Star1 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star5 - direction
	Star6 - direction
	GroundStation8 - direction
	Star9 - direction
	Star10 - direction
	Star7 - direction
	Planet11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 thermograph4)
	(supports instrument0 spectrograph2)
	(supports instrument0 spectrograph0)
	(supports instrument0 spectrograph6)
	(supports instrument0 infrared5)
	(supports instrument0 spectrograph1)
	(supports instrument0 infrared3)
	(calibration_target instrument0 Star7)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon13)
)
(:goal (and
	(pointing satellite0 Star1)
	(have_image Planet11 spectrograph6)
	(have_image Star12 spectrograph1)
	(have_image Phenomenon13 spectrograph0)
	(have_image Planet14 infrared5)
	(have_image Planet14 spectrograph6)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (turn_to satellite0 star7 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star7)
   goals met: 0 of 6
3. (calibrate satellite0 instrument0 star7)
   added: (calibrated instrument0)
   goals met: 0 of 6
4. (turn_to satellite0 phenomenon13 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 phenomenon13)
   goals met: 0 of 6
5. (take_image satellite0 phenomenon13 instrument0 spectrograph0)
   added: (have_image phenomenon13 spectrograph0)
   goals met: 1 of 6
6. (turn_to satellite0 planet11 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet11)
   goals met: 1 of 6
7. (take_image satellite0 planet11 instrument0 spectrograph6)
   added: (have_image planet11 spectrograph6)
   goals met: 2 of 6
8. (turn_to satellite0 planet14 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet14)
   goals met: 2 of 6
9. (take_image satellite0 planet14 instrument0 infrared5)
   added: (have_image planet14 infrared5)
   goals met: 3 of 6
10. (take_image satellite0 planet14 instrument0 spectrograph6)
   added: (have_image planet14 spectrograph6)
   goals met: 4 of 6
11. (turn_to satellite0 star1 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star1)
   goals met: 5 of 6
12. (turn_to satellite0 star12 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star12)
   goals met: 4 of 6
13. (take_image satellite0 star12 instrument0 spectrograph1)
   added: (have_image star12 spectrograph1)
   goals met: 5 of 6
14. (turn_to satellite0 star1 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star1)
   goals met: 6 of 6
